<?php

namespace App\Helpers;

class TextHelper
{
    public static function transliterate($text): string
    {
        $source = [
            'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я',
            'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П', 'Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я',
            'Қ','қ','Ў','ў','Ҳ','ҳ','Ғ','ғ','ʼ','Oʻ','oʻ','Gʻ','gʻ','Õ','õ','Ö','ö','Ğ','ğ','Ō','ō','Ò','ò','Ó','ó','Ô','ô',
        ];
        $dest = [
            'a','b','v','g','d','e','yo','j','z','i','y','k','l','m','n','o','p','r','s','t','u','f','x','s','ch','sh','sh','\'','i','','e','yu','ya',
            'A','B','V','G','D','Ye','Yo','J','Z','I','Y','K','L','M','N','O','P', 'R','S','T','U','F','X','S','Ch','Sh','Sh','\'','I','','E','Yu','Ya',
            'Q','q','O\'','o\'','H','h','G\'','g\'','\'','O\'','o\'','G\'','g\'','O\'','o\'','O\'','o\'','G\'','g\'','O\'','o\'','O\'','o\'','O\'','o\'','O\'','o\'',
        ];

        return str_replace($source, $dest, $text);
    }
}
